[{"name":"Witch Bolt","desc":"<p>A beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spellΓÇÖs range or if it has total cover from you.</p>","higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d12 for each slot level above 1st.</p>","page":"phb 289","range":"30 feet","components":"V, S, M","material":"A twig from a tree that has been struck by lightning.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"1st-level","school":"Evocation","class":"Sorcerer, Warlock, Wizard"},{"name":"Magic Missile","desc":"<p>You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.</p>","higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.</p>","page":"phb 257","range":"120 feet","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"1st-level","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Burning Hands","desc":"<p>As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire ignites any flammable objects in the area that arenΓÇÖt being worn or carried.</p>","higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.</p>","page":"phb 220","range":"Self","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"1st-level","school":"Evocation","class":"Cleric, Sorcerer, Warlock, Wizard","archetype":"Cleric: Light<br/> Warlock: Fiend","domains":"Light","patrons":"Fiend"},{"name":"Thunderwave","desc":"<p>A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isnΓÇÖt pushed.</p><p>In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spellΓÇÖs effect, and the spell emits a thunderous boom audible out to 300 feet.</p>","higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.</p>","page":"phb 282","range":"Self","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"1st-level","school":"Evocation","class":"Bard, Cleric, Druid, Sorcerer, Wizard","archetype":"Cleric: Tempest","domains":"Tempest"},{"name":"Chromatic Orb","desc":"<p>You hurl a 4-inch-diameter sphere of energy at a creature that you can see within range. You choose acid, cold, fire, lightning, poison, or thunder for the type of orb you create, and then make a ranged spell attack against the target. If the attack hits, the creature takes 3d8 of the type you chose.</p>","higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.</p>","page":"phb 221","range":"90 feet","components":"V, S, M","material":"A diamond worth at least 50gp.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"1st-level","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Scorching Ray","desc":"<p>You generate three rays of fire and will throw to targets in the range of the spell. You can project them on one or more targets.</p><p>Perform a remote attack spell for each department. If it hits, the target takes 2d6 fire damage.</p>","higher_level":"<p>When you cast this spell using a 3 or higher level spell slot, you generate an additional radius for each level of higher spell slot 2.</p>","page":"phb 273","range":"120 feet","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"2nd-level","school":"Evocation","class":"Cleric, Sorcerer, Warlock, Wizard","archetype":"Cleric: Light<br/> Warlock: Fiend","domains":"Light","patrons":"Fiend"},{"name":"Shatter","desc":"<p>A strong resonant sound painfully intense sounds of a desired point in the range of the spell. Each creature has a sphere with a 10-foot-radius sphere centered on that point must make a constitution saving throw or it suffers 3d8 thunder damage. If successful, the damage is halved. A creature made of inorganic materials such as stone, crystal or metal, makes its saving throw with a disadvantage.</p><p>A non-magical item that is not worn or carried also suffers damage if it is in the area of ΓÇïΓÇïthe spell.</p>","higher_level":"<p>When you cast this spell using a 3 or higher level spell slot, the damage of the spell increases by 1d8 for each level of higher spell slot 2.</p>","page":"phb 275","range":"60 feet","components":"V, S, M","material":"A burst of mica.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"2nd-level","school":"Evocation","class":"Bard, Cleric, Sorcerer, Warlock, Wizard","archetype":"Cleric: Tempest","domains":"Tempest"},{"name":"Continual Flame","desc":"<p>A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched.</p>","page":"phb 227","range":"Touch","components":"V, S, M","material":"Ruby dust worth 50 gp, which the spell consumes.","ritual":"no","duration":"Until dispelled","concentration":"no","casting_time":"1 action","level":"2nd-level","school":"Evocation","class":"Cleric, Wizard"},{"name":"Melf's Acid Arrow","desc":"<p>A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.</p>","higher_level":"<p>When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 1d4 for each slot level above 2nd.</p>","page":"phb 259","range":"90 feet","components":"V, S, M","material":"Powdered rhubarb leaf and an adderΓÇÖs stomach.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"2nd-level","school":"Evocation","class":"Druid, Wizard","archetype":"Druid: Swamp","circles":"Swamp"},{"name":"Darkness","desc":"<p>Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision canΓÇÖt see through this darkness, and nonmagical light canΓÇÖt illuminate it.</p><p>If the point you choose is on an object you are holding or one that isnΓÇÖt being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.</p><p>If any of this spellΓÇÖs area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.</p>","page":"phb 230","range":"60 feet","components":"V, M","material":"Bat fur and a drop of pitch or piece of coal.","ritual":"no","duration":"Up to 10 minutes","concentration":"yes","casting_time":"1 action","level":"2nd-level","school":"Evocation","class":"Druid, Sorcerer, Warlock, Wizard","archetype":"Druid: Swamp","circles":"Swamp"},{"name":"Gust of Wind","desc":"<p>A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a strength saving throw or be pushed 15 feet away from you in a direction following the line.</p><p>Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.</p><p>The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.</p><p>As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.</p>","page":"phb 248","range":"Self","components":"V, S, M","material":"A legume seed.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"2nd-level","school":"Evocation","class":"Cleric, Druid, Sorcerer, Wizard","archetype":"Cleric: Tempest","domains":"Tempest"},{"name":"Sending","desc":"<p>You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message.</p><p>You can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesnΓÇÖt arrive.</p>","page":"phb 274","range":"Unlimited","components":"V, S, M","material":"A short piece of fine copper wire.","ritual":"no","duration":"1 round","concentration":"no","casting_time":"1 action","level":"3rd-level","school":"Evocation","class":"Bard, Cleric, Warlock, Wizard","archetype":"Warlock: Great Old One","patrons":"Great Old One"},{"name":"Leomund's Tiny Hut","desc":"<p>A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.</p><p>Nine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects canΓÇÖt extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside.</p><p>Until the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.</p>","page":"phb 255","range":"Self","components":"V, S, M","material":"A small crystal bead.","ritual":"yes","duration":"8 hours","concentration":"no","casting_time":"1 minute","level":"3rd-level","school":"Evocation","class":"Bard, Ritual Caster, Wizard"},{"name":"Lightning Bolt","desc":"<p>A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one.</p><p>The lightning ignites flammable objects in the area that arenΓÇÖt being worn or carried.</p>","higher_level":"<p>When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.</p>","page":"phb 255","range":"Self","components":"V, S, M","material":"A bit of fur and a rod of amber, crystal, or glass.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"3rd-level","school":"Evocation","class":"Druid, Sorcerer, Wizard","archetype":"Druid: Mountain","circles":"Mountain"},{"name":"Fireball","desc":"<p>A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire spreads around corners. It ignites flammable objects in the area that arenΓÇÖt being worn or carried.</p>","higher_level":"<p>When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.</p>","page":"phb 241","range":"150 feet","components":"V, S, M","material":"A tiny ball of bat guano and sulfur.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"3rd-level","school":"Evocation","class":"Cleric, Sorcerer, Warlock, Wizard","archetype":"Cleric: Light<br/> Warlock: Fiend","domains":"Light","patrons":"Fiend"},{"name":"Fire Shield","desc":"<p>Thin and vaporous flame surround your body for the duration of the spell, radiating a bright light bright light in a 10-foot radius and dim light for an additional 10 feet. You can end the spell using an action to make it disappear.</p><p>The flames are around you a heat shield or cold, your choice. The heat shield gives you cold damage resistance and the cold resistance to fire damage.</p><p>In addition, whenever a creature within 5 feet of you hits you with a melee attack, flames spring from the shield. The attacker then suffers 2d8 points of fire damage or cold, depending on the model. </p>","page":"phb 242","range":"Self","components":"V, S, M","material":"A little phosphorus or a firefly.","ritual":"no","duration":"10 minutes","concentration":"no","casting_time":"1 action","level":"4th-level","school":"Evocation","class":"Warlock, Wizard","archetype":"Warlock: Fiend","patrons":"Fiend"},{"name":"Ice Storm","desc":"<p>A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a dexterity saving throw. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, or half as much damage on a successful one.</p><p>Hailstones turn the stormΓÇÖs area of effect into difficult terrain until the end of your next turn.</p>","higher_level":"<p>When you cast this spell using a spell slot of 5th level or higher, the bludgeoning damage increases by 1d8 for each slot level above 4th.</p>","page":"phb 252","range":"300 feet","components":"V, S, M","material":"A pinch of dust and a few drops of water.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"4th-level","school":"Evocation","class":"Cleric, Druid, Paladin, Sorcerer, Wizard","archetype":"Cleric: Tempest<br/> Paladin: Ancients","domains":"Tempest","circles":"Arctic","oaths":"Ancients"},{"name":"Wall of Fire","desc":"<p>You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.</p><p>When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.</p><p>One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet o f that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side o f the wall deals no damage.</p><p>The other side of the wall deals no damage.</p>","higher_level":"<p>When you cast this spell using a level spell slot 5 or more, the damage of the spell increases by 1d8 for each level of higher spell slot to 4.</p>","page":"phb 285","range":"120 feet","components":"V, S, M","material":"A small piece of phosphorus.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"4th-level","school":"Evocation","class":"Cleric, Druid, Sorcerer, Warlock, Wizard","archetype":"Cleric: Light<br/> Warlock: Fiend","domains":"Light","patrons":"Fiend"},{"name":"Otiluke's Resilient Sphere","desc":"<p>A sphere of shimmering force encloses a creature or object of Large size or smaller within range. An unwilling creature must make a dexterity saving throw. On a failed save, the creature is enclosed for the duration.</p><p>NothingΓÇönot physical objects, energy, or other spell effectsΓÇöcan pass through the barrier, in or out, though a creature in the sphere can breathe there. The sphere is immune to all damage, and a creature or object inside canΓÇÖt be damaged by attacks or effects originating from outside, nor can a creature inside the sphere damage anything outside it.</p><p>The sphere is weightless and just large enough to contain the creature or object inside. An enclosed creature can use its action to push against the sphereΓÇÖs walls and thus roll the sphere at up to half the creatureΓÇÖs speed. Similarly, the globe can be picked up and moved by other creatures.</p><p>A disintegrate spell targeting the globe destroys it without harming anything inside it.</p>","page":"phb 264","range":"30 feet","components":"V, S, M","material":"A hemispherical piece of clear crystal and a matching hemispherical piece of gum arabic.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"4th-level","school":"Evocation","class":"Wizard"},{"name":"Wall of Force","desc":"<p>An invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose, as a horizontal or vertical barrier or at an angle. It can be free floating or resting on a solid surface. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel. In any form, the wall is 1/4 inch thick. It lasts for the duration. If the wall cuts through a creatureΓÇÖs space when it appears, the creature is pushed to one side of the wall (your choice which side).</p><p>Nothing can physically pass through the wall. It is immune to all damage and canΓÇÖt be dispelled by dispel magic. A disintegrate spell destroys the wall instantly, however. The wall also extends into the Ethereal Plane, blocking ethereal travel through the wall.</p>","page":"phb 285","range":"120 feet","components":"V, S, M","material":"A pinch of powder made by crushing a clear gemstone.","ritual":"no","duration":"Up to 10 minutes","concentration":"yes","casting_time":"1 action","level":"5th-level","school":"Evocation","class":"Wizard"},{"name":"Bigby's Hand","desc":"<p>You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spellΓÇÖs duration, and it moves at your command, mimicking the movements of your own hand.</p><p>The hand is an object that has AC 20 and hit points equal to your hit point maximum. If it drops to 0 hit points, the spell ends. It has a Strength of 26 (+8) and a Dexterity of 10 (+0). The hand doesnΓÇÖt fill its space.</p><p>When you cast the spell and as a bonus action on your subsequent turns, you can move the hand up to 60 feet and then cause one of the following effects with it.</p><p><b>Clenched Fist.</b> The hand strikes one creature or object within 5 feet of it. Make a melee spell attack for the hand using your game statistics. On a hit, the target takes 4d8 force damage.</p><p><b>Forceful Hand.</b> The hand attempts to push a creature within 5 feet of it in a direction you choose. Make a check with the handΓÇÖs Strength contested by the Strength (Athletics) check of the target. If the target is Medium or smaller, you have advantage on the check. If you succeed, the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target to remain within 5 feet of it.</p><p><b>Grasping Hand.</b> The hand attempts to grapple a Huge or smaller creature within 5 feet of it. You use the handΓÇÖs Strength score to resolve the grapple. If the target is Medium or smaller, you have advantage on the check. While the hand is grappling the target, you can use a bonus action to have the hand crush it. When you do so, the target takes bludgeoning damage equal to 2d6 + your spellcasting ability modifier.</p><p><b>Interposing Hand.</b> The hand interposes itself between you and a creature you choose until you give the hand a different command. The hand moves to stay between you and the target, providing you with half cover against the target. The target can't move through the handΓÇÖs space if its Strength score is less than or equal to the handΓÇÖs Strength score. If its Strength score is higher than the handΓÇÖs Strength score, the target can move toward you through the handΓÇÖs space, but that space is difficult terrain for the target.</p>","higher_level":"<p>When you cast this spell using a spell slot of 6th level or higher, the damage from the clenched fist option increases by 2d8 and the damage from the grasping hand increases by 2d6 for each slot level above 5th.</p>","page":"phb 218","range":"120 feet","components":"V, S, M","material":"An eggshell and a snakeskin glove.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"5th-level","school":"Evocation","class":"Wizard"},{"name":"Cone of Cold","desc":"<p>A blast of cold air erupts from your hands. Each creature in a 60-foot cone must make a constitution saving throw. A creature takes 8d8 cold damage on a failed save, or half as much damage on a successful one.</p><p>A creature killed by this spell becomes a frozen statue until it thaws.</p>","higher_level":"<p>When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.</p>","page":"phb 224","range":"Self","components":"V, S, M","material":"A small crystal or glass cone.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"5th-level","school":"Evocation","class":"Druid, Sorcerer, Wizard","archetype":"Druid: Arctic","circles":"Arctic"},{"name":"Wall of Stone","desc":"<p>A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick.</p><p>If the wall cuts through a creatureΓÇÖs space when it appears, the creature is pushed to one side of the wall (your choice). If a creature would be surrounded on all sides by the wall (or the wall and another solid surface), that creature can make a dexterity saving throw. On a success, it can use its reaction to move up to its speed so that it is no longer enclosed by the wall.</p><p>The wall can have any shape you desire, though it canΓÇÖt occupy the same space as a creature or object. The wall doesnΓÇÖt need to be vertical or rest on any firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp.</p><p>If you create a span greater than 20 feet in length, you must halve the size of each panel to create supports. You can crudely shape the wall to create crenellations, battlements, and so on.</p><p>The wall is an object made of stone that can be damaged and thus breached. Each panel has AC 15 and 30 hit points per inch of thickness. Reducing a panel to 0 hit points destroys it and might cause connected panels to collapse at the DMΓÇÖs discretion.</p><p>If you maintain your concentration on this spell for its whole duration, the wall becomes permanent and canΓÇÖt be dispelled. Otherwise, the wall disappears when the spell ends.</p>","page":"phb 287","range":"120 feet","components":"V, S, M","material":"A small block of granite.","ritual":"no","duration":"Up to 10 minutes","concentration":"yes","casting_time":"1 action","level":"5th-level","school":"Evocation","class":"Druid, Sorcerer, Wizard","circles":"Desert, Mountain"},{"name":"Chain Lightning","desc":"<p>You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts.</p><p>A target must make a dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one.</p>","higher_level":"<p>When you cast this spell using a spell slot of 7th level or higher, one additional bolt leaps from the first target to another target for each slot level above 6th.</p>","page":"phb 221","range":"150 feet","components":"V, S, M","material":"A bit of fur; a piece of amber, glass, or a crystal rod; and three silver pins.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"6th-level","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Sunbeam","desc":"<p>A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isnΓÇÖt blinded by this spell. Undead and oozes have disadvantage on this saving throw.</p><p>You can create a new line of radiance as your action on any turn until the spell ends.</p><p>For the duration, a mote of brilliant radiance shines in your hand. It sheds bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight.</p>","page":"phb 279","range":"Self","components":"V, S, M","material":"A magnifying glass.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"6th-level","school":"Evocation","class":"Druid, Sorcerer, Wizard"},{"name":"Otiluke's Freezing Sphere","desc":"<p>A frigid globe of cold energy streaks from your fingertips to a point of your choice within range, where it explodes in a 60-foot-radius sphere. Each creature within the area must make a constitution saving throw. On a failed save, a creature takes 10d6 cold damage. On a successful save, it takes half as much damage.</p><p>If the globe strikes a body of water or a liquid that is principally water (not including water-based creatures), it freezes the liquid to a depth of 6 inches over an area 30 feet square. This ice lasts for 1 minute. Creatures that were swimming on the surface of frozen water are trapped in the ice. A trapped creature can use an action to make a Strength check against your spell save DC to break free.</p><p>You can refrain from firing the globe after completing the spell, if you wish. A small globe about the size of a sling stone, cool to the touch, appears in your hand. At any time, you or a creature you give the globe to can throw the globe (to a range of 40 feet) or hurl it with a sling (to the slingΓÇÖs normal range). It shatters on impact, with the same effect as the normal casting of the spell. You can also set the globe down without shattering it. After 1 minute, if the globe hasnΓÇÖt already shattered, it explodes.</p>","higher_level":"<p>When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d6 for each slot level above 6th.</p>","page":"phb 263","range":"300 feet","components":"V, S, M","material":"A small crystal sphere.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"6th-level","school":"Evocation","class":"Wizard"},{"name":"Contingency","desc":"<p>Choose a spell of 5th level or lower that you can cast, that has a casting time of 1 action, and that can target you. You cast that spellΓÇöcalled the contingent spellΓÇöas part of casting contingency, expending spell slots for both, but the contingent spell doesn't come into effect. Instead, it takes effect when a certain circumstance occurs. You describe that circumstance when you cast the two spells. For example, a contingency cast with water breathing might stipulate that water breathing comes into effect when you are engulfed in water or a similar liquid. </p><p>The contingent spell takes effect immediately after the circumstance is met for the first time, whether or not you want it to. and then contingency ends.</p><p>The contingent spell takes effect only on you, even if it can normally target others. You can use only one contingency spell at a time. If you cast this spell again, the effect of another contingency spell on you ends. Also, contingency ends on you if its material component is ever not on your person.</p>","page":"phb 227","range":"Self","components":"V, S, M","material":"A statuette of yourself carved from ivory and decorated with gems worth at least 1,500 gp.","ritual":"no","duration":"10 days","concentration":"no","casting_time":"10 minutes","level":"6th-level","school":"Evocation","class":"Wizard"},{"name":"Wall of Ice","desc":"<p>You create a wall of ice on a solid surface within range. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-square panels. Each panel must be contiguous with another panel. In any form, the wall is 1 foot thick and lasts for the duration.</p><p>If the wall cuts through a creatureΓÇÖs space when it appears, the creature within its area is pushed to one side of the wall and must make a dexterity saving throw. On a failed save, the creature takes 10d6 cold damage, or half as much damage on a successful save.</p><p>The wall is an object that can be damaged and thus breached. It has AC 12 and 30 hit points per 10-foot section, and it is vulnerable to fire damage. Reducing a 10-foot section of wall to 0 hit points destroys it and leaves behind a sheet of frigid air in the space the wall occupied. A creature moving through the sheet of frigid air for the first time on a turn must make a constitution saving throw. That creature takes 5d6 cold damage on a failed save, or half as much damage on a successful one.</p>","higher_level":"<p>When you cast this spell using a spell slot of 7th level or higher, the damage the wall deals when it appears increases by 2d6, and the damage from passing through the sheet of frigid air increases by 1d6, for each slot level above 6th.</p>","page":"phb 285","range":"120 feet","components":"V, S, M","material":"A small piece of quartz.","ritual":"no","duration":"Up to 10 minutes","concentration":"yes","casting_time":"1 action","level":"6th-level","school":"Evocation","class":"Wizard"},{"name":"Prismatic Spray","desc":"<p>Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a dexterity saving throw. For each target, roll a d8 to determine which color ray affects it.</p><p><b>1. Red.</b> The target takes 10d6 fire damage on a failed save, or half as much damage on a successful one.</p><p><b>2. Orange.</b> The target takes 10d6 acid damage on a failed save, or half as much damage on a successful one.</p><p><b>3. Yellow.</b> The target takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.</p><p><b>4. Green.</b> The target takes 10d6 poison damage on a failed save, or half as much damage on a successful one.</p><p><b>5. Blue.</b> The target takes 10d6 cold damage on a failed save, or half as much damage on a successful one.</p><p><b>6. Indigo.</b> On a failed save, the target is restrained. It must then make a constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures donΓÇÖt need to be consecutive; keep track of both until the target collects three of a kind.</p><p><b>7. Violet.</b> On a failed save, the target is blinded. It must then make a wisdom saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of existence of the DMΓÇÖs choosing and is no longer blinded. (Typically, a creature that is on a plane that isnΓÇÖt its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.)</p><p><b>8. Special.</b> The target is struck by two rays. Roll twice more, rerolling any 8.</p>","page":"phb 267","range":"Self","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"7th-level","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Mordenkainen's Sword","desc":"<p>You create a sword-shaped plane of force that hovers within range. It lasts for the duration.</p><p>When the sword appears, you make a melee spell attack against a target of your choice within 5 feet of the sword. On a hit, the target takes 3d10 force damage. Until the spell ends, you can use a bonus action on each of your turns to move the sword up to 20 feet to a spot you can see and repeat this attack against the same target or a different one.</p>","page":"phb 262","range":"60 feet","components":"V, S, M","material":"A miniature platinum sword with a grip and pommel of copper and zinc, worth 250 gp.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"7th-level","school":"Evocation","class":"Bard, Wizard"},{"name":"Forcecage","desc":"<p>An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box, as you choose.</p><p>A prison in the shape of a cage can be up to 20 feet on a side and is made from 1/2-inch diameter bars spaced 1/2 inch apart. </p><p>A prison in the shape of a box can be up to 10 feet on a side, creating a solid barrier that prevents any matter from passing through it and blocking any spells cast into or out from the area.</p><p>When you cast the spell, any creature that is completely inside the cage's area is trapped. Creatures only partially within the area, or those too large to fit inside the area, are pushed away from the center of the area until they are completely outside the area.</p><p>A creature inside the cage canΓÇÖt leave it by nonmagical means. If the creature tries to use teleportation or interplanar travel to leave the cage, it must first make a charisma saving throw. On a success, the creature can use that magic to exit the cage. On a failure, the creature can't exit the cage and wastes the use of the spell or effect. The cage also extends into the Ethereal Plane, blocking ethereal travel.</p><p>This spell canΓÇÖt be dispelled by dispel magic.</p>","page":"phb 243","range":"100 feet","components":"V, S, M","material":"Ruby dust worth 1,500 gp.","ritual":"no","duration":"1 hour","concentration":"no","casting_time":"1 action","level":"7th-level","school":"Evocation","class":"Bard, Warlock, Wizard"},{"name":"Delayed Blast Fireball","desc":"<p>A beam of yellow light flashes from your pointing finger, then condenses to linger at a chosen point within range as a glowing bead for the duration. When the spell ends, either because your concentration is broken or because you decide to end it, the bead blossoms with a low roar into an explosion of flame that spreads around corners. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A creature takes fire damage equal to the total accumulated damage on a failed save, or half as much damage on a successful one.</p><p>The spellΓÇÖs base damage is 12d6. If at the end of your turn the bead has not yet detonated, the damage increases by 1d6.</p><p>If the glowing bead is touched before the interval has expired, the creature touching it must make a dexterity saving throw. On a failed save, the spell ends immediately, causing the bead to erupt in flame. On a successful save, the creature can throw the bead up to 40 feet. When it strikes a creature or a solid object, the spell ends, and the bead explodes.</p><p>The fire damages objects in the area and ignites flammable objects that arenΓÇÖt being worn or carried.</p>","higher_level":"<p>When you cast this spell using a spell slot of 8th level or higher, the base damage increases by 1d6 for each slot level above 7th.</p>","page":"phb 230","range":"150 feet","components":"V, S, M","material":"A tiny ball of bat guano and sulfur.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"7th-level","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Sunburst","desc":"<p>Brilliant sunlight flashes in a 60-foot radius centered on a point you choose within range. Each creature in that light must make a constitution saving throw. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isnΓÇÖt blinded by this spell. Undead and oozes have disadvantage on this saving throw.</p><p>A creature blinded by this spell makes another constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.</p><p>This spell dispels any darkness in its area that was created by a spell.</p>","page":"phb 279","range":"150 feet","components":"V, S, M","material":"Fire and a piece of sunstone.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"8th-level","school":"Evocation","class":"Druid, Sorcerer, Wizard"},{"name":"Telepathy","desc":"<p>You create a telepathic link between yourself and a willing creature with which you are familiar. The creature can be anywhere on the same plane of existence as you. The spell ends if you or the target are no longer on the same plane.</p><p>Until the spell ends, you and the target can instantaneously share words, images, sounds, and other sensory messages with one another through the link, and the target recognizes you as the creature it is communicating with. The spell enables a creature with an Intelligence score of at least 1 to understand the meaning of your words and take in the scope of any sensory messages you send to it.</p>","page":"phb 281","range":"Unlimited","components":"V, S, M","material":"A pair of linked silver rings.","ritual":"no","duration":"24 hours","concentration":"no","casting_time":"1 action","level":"8th-level","school":"Evocation","class":"Wizard"},{"name":"Meteor Swarm","desc":"<p>Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a dexterity saving throw. The sphere spreads around corners. A creature takes 20d6 fire damage and 20d6 bludgeoning damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once.</p><p>The spell damages objects in the area and ignites flammable objects that arenΓÇÖt being worn or carried.</p>","page":"phb 259","range":"1 mile","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"9th-level","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Fire Bolt","desc":"<p>You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isnΓÇÖt being worn or carried.</p><p>This spellΓÇÖs damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).</p>","page":"phb 242","range":"120 feet","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Dancing Lights","desc":"<p>You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius.</p><p>As a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spellΓÇÖs range.</p>","page":"phb 230","range":"120 feet","components":"V, S, M","material":"A bit of phosphorus or wychwood, or a glowworm.","ritual":"no","duration":"Up to 1 minute","concentration":"yes","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Bard, Sorcerer, Wizard"},{"name":"Green-Flame Blade","desc":"<p>As part of the action used the cast this spell, you must make a melee attack with a weapon against one create within the spell's range otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and green fire leaps from the target to a different creature of your choice that you can see within 5 feet of it. The second creature take fire damage equal to your spellcasting modifier.</p><p>This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 fire damage to the target, and the fire damage to the second creature increases to 18d + your spellcasting ability modifier. Both damage rolls increase by 1d8 at 11th level and 17th level.</p>","page":"scag 143","range":"5 feet","components":"V, M","material":"A weapon.","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Sorcerer, Warlock, Wizard"},{"name":"Ray of Frost","desc":"<p>A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.</p><p>The spellΓÇÖs damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>","page":"phb 271","range":"60 feet","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Shocking Grasp","desc":"<p>Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it canΓÇÖt take reactions until the start of its next turn.</p><p>The spellΓÇÖs damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>","page":"phb 275","range":"Touch","components":"V, S","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Sorcerer, Wizard"},{"name":"Light","desc":"<p>You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.</p><p>If you target an object held or worn by a hostile creature, that creature must succeed on a dexterity saving throw to avoid the spell.</p>","page":"phb 255","range":"Touch","components":"V, M","material":"A firefly or phosphorescent moss.","ritual":"no","duration":"1 hour","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Bard, Cleric, Sorcerer, Wizard"},{"name":"Booming Blade","desc":"<p>As part of the action used the cast this spell, you must make a melee attack with a weapon against one create within the spell's range otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and it becomes sheathed in booming energy until the start of your next turn. If the target willingly moves before then, it immediately takes 1d8 thunder damage, and the spell ends.</p><p>This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 thunder damage to the target, and the damage the target take for moving increases to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level.</p>","page":"scag 142","range":"5 feet","components":"V, M","material":"A weapon.","ritual":"no","duration":"1 round","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Sorcerer, Warlock, Wizard"},{"name":"Lightning Lure","desc":"<p>You create a lash of lightning energy that strikes at one creature of your choice that you can see within range. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d8 lightning damage if it is within 5 feet of you.</p><p>This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>","page":"scag 143","range":"15 feet","components":"V","ritual":"no","duration":"Instantaneous","concentration":"no","casting_time":"1 action","level":"Cantrip","school":"Evocation","class":"Sorcerer, Warlock, Wizard"}]